'''у матриці 4*4, що задана користувачем замініть всі від’ємні елементи на 0.'''

import numpy as np # імпортуємо бібліотеку NumPy

print('Введіть елементи матриці А:')
a = np.zeros((4, 4), dtype=int) # задаємо масив A розмірністю 4 на 4, заповнений нулями, тиа даних - цілочисельний
for i in range(4):
    for j in range(4):
        a[i, j] = int(input(f'A[{i}, {j}] = ')) # за допомогою циклу користувач надає значення кожному елементу масиву

for i in range (4):
    for j in range (4):
        if (a[i, j] < 0): # за допомогою циклу перевіряємо кожний елемент масиву, чи від'ємний він
            a[i, j] = 0 # якщо елемент від'ємний, то замінюємо його на нуль

print() # робимо відступ від попередніх записів
print(a) # виводимо результат