'''виконайте добуток двох квадратних матриць 3*3, врахуйте розмірність.
Результати множення елементів занесіть до нової матриці та виведіть її на екран;'''

import numpy as np # імпортуємо бібліотеку NumPy

print('Введіть елементи матриці А:')
a = np.zeros((3, 3), dtype=int) # задаємо масив A розмірністю 3 на 3, заповнений нулями, тиа даних - цілочисельний
for i in range(3):
    for j in range(3):
        a[i, j] = int(input(f'A[{i}, {j}] = ')) # за допомогою циклу користувач надає значення кожному елементу масиву

print()
print('Введіть елементи матриці B:')
b = np.zeros((3, 3), dtype=int) # повторюємо те ж саме з матрицею B
for i in range(3):
    for j in range(3):
        b[i, j] = int(input(f'B[{i}, {j}] = '))

c = np.zeros((3, 3), dtype=int) # задаємо масив С, в який будемо вводити елементи множення матриць A та B
c[0, 0] = a[0][0] * b[0][0] + a[0][1] * b[1][0] + a[0][2] * b[2][0] # знаходимо кожний елемент множення
c[0, 1] = a[0][0] * b[0][1] + a[0][1] * b[1][1] + a[0][2] * b[2][1]
c[0, 2] = a[0][0] * b[0][2] + a[0][1] * b[1][2] + a[0][2] * b[2][2]
c[1, 0] = a[1][0] * b[0][0] + a[1][1] * b[1][0] + a[1][2] * b[2][0]
c[1, 1] = a[1][0] * b[0][1] + a[1][1] * b[1][1] + a[1][2] * b[2][1]
c[1, 2] = a[1][0] * b[0][2] + a[1][1] * b[1][2] + a[1][2] * b[2][2]
c[2, 0] = a[2][0] * b[0][0] + a[2][1] * b[1][0] + a[2][2] * b[2][0]
c[2, 1] = a[2][0] * b[0][1] + a[2][1] * b[1][1] + a[2][2] * b[2][1]
c[2, 2] = a[2][0] * b[0][2] + a[2][1] * b[1][2] + a[2][2] * b[2][2]

print() # робимо відступ від попередніх записів
print('Добуток двох квадратних матриць:')
print(c) # виводимо результат множення

