'''виведіть на екран елементи лінійного масиву (заданий користувачем) у
зворотному порядку'''

import numpy as np # імпортуємо бібліотеку NumPy

m = input('Введіть елементи лінійного масиву через пробіл: ') # користувач вводить масив у вигляді рядка
m = m.split() # утворюємо список із рядка, розділяючи елементи по пробілу
array = np.array(m) # утворюємо масив зі списку за допомогою функцію array із бібліотеки numpy
print(f'Елементи лінійного масиву у зворотньому порядку: {array[::-1]}.') # виводимо масив у зворотньому порядку за допомогою оператора вилучення зрізу