'''Прямий пошук підрядка'''

while True:
    string = input('Введіть рядок тексту: ') # користувач вводить рядок
    pattern = input('Введіть підрядок: ') # користувач вводить підрядок

    i = -1  # змінна, яка відповідає за всі індекси рядка
    j = 0  # змінна, яка відповідає за всі індекси підрядка
    count = 0

    while (j < len(pattern)) and i < (len(string) - len(pattern)): # якщо індекс підрядка менший за його довжину та індекс рядка менший
        # за різницю довжин рядка і підрядка (інакше не знайти підрядка в рядку), ми можемо продовжувати пошук
        j = 0
        i += 1
        count += 1
        while (j < len(pattern) and pattern[j] == string[i + j]): # поки індекс підрядка менший за його довжину та символ підрядка збігається з символом рядка,
            # перевіряємо кожний наступний елемент, додаючи індекс підрядка до попереднього
            j += 1

    if (j == len(pattern)): # якщо кожний елемент підрядка співвпав із елементом рядка, тобто індекс підрядка = його довжині, то підрядок починається з позиції і
        print(f'Підрядок знайдений на позиції {i}.')
        print(f'Кількість порівнянь: {count}.')  # виводимо кількість порівнянь
    else: # інакше - підрядок у рядку не знайдено
        print('Підрядок не знайдено.')
        print(f'Кількість порівнянь: {count}.')  # виводимо кількість порівнянь

    print()
    print('Бажаєте повторити задачу?')  # питаємо чи бажає користувач повторити задачу
    while True:
        question = input('(Так/Ні): ')
        if (
                question == 'Так' or question == 'так' or question == 'Yes' or question == 'yes' or question == 'y' or question == '+'):
            print()
            break
        elif (
                question == 'Ні' or question == 'ні' or question == 'No' or question == 'no' or question == 'n' or question == '-'):
            exit(0)
        else:
            print()
            print('Бажаєте повторити задачу?')
