'''виведіть на екран транспоновану матрицю 3*3 (початкова матриця задана
користувачем)'''

import numpy as np # імпортуємо бібліотеку NumPy

print('Введіть елементи матриці 3*3:')
a = np.zeros((3, 3), dtype=int) # задаємо масив розмірністю 3 на 3, заповнений нулями, тиа даних - цілочисельний
for i in range(3):
    for j in range(3):
        a[i, j] = int(input(f'A[{i}, {j}] = ')) # за допомогою циклу користувач надає значення кожному елементу масиву

print() # робимо відступ від попередніх записів
b = np.zeros((3, 3), dtype=int) # робимо копію масиву а для того, щоб брати із неї елементи для транспортування (якщо цього не зробити, матриця транспонується не правильно)
for i in range(3):
    for j in range(3):
        b[j, i] = a[i, j] # за допомогою циклу надаємо значення кожному елементу масиву (рядок на стовпчик, а стовпчик - на рядок)

print(b) # виводимо транспоновану матрицю
